In [1]:
import pandas as pd

In [2]:
order1=pd.read_csv('order_products__prior.csv')
order2=pd.read_csv('order_products__train.csv')

In [3]:
order1.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [4]:
order2.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [5]:
orders=order1.append(order2)

In [6]:
print("First Order Csv:{0}\nSecond Order Csv:{1}\nMerged Order Csv:{2}".format(order1.shape,order2.shape,orders.shape))

First Order Csv:(32434489, 4)
Second Order Csv:(1384617, 4)
Merged Order Csv:(33819106, 4)

In [7]:
32434489+1384617==33819106

True

In [8]:
orders.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [9]:
NewOrders=orders.drop(['add_to_cart_order','reordered'],axis=1)

In [10]:
NewOrders.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [11]:
NewOrders.to_csv('NewOrder.csv',index= False)